
#ifndef _GPIO_C_
#define _GPIO_C_
/*********************************************************************************************************************/
#include "include/ca51f_config.h"		
#include "include/ca51f2sfr.h"
#include "include/ca51f2xsfr.h"
#include "include/gpiodef_f2.h"
#include "include/system_clock.h"

#include "include/uart.h"
#include "include/lcd_led.h"
#include "include/delay.h"
#include "include/lcd.h"
#include "include/gpio.h"
#include <intrins.h>
/*********************************************************************************************************************			

	P00F = OUTPUT;					//P00设置为推挽输出模式
	P00C |= 0x80;					//P00使能高灌电流模式
	
	P00F = INPUT|PU_EN;				//P00设置为输入模式并使能上拉电阻
	P00C |= 0x20;					//上拉电阻选择为强上拉
// 	P00C &= ~0x20;					//上拉电阻选择为弱上拉

	P00F = INPUT|PD_EN;				//P00设置为输入模式并使能下拉电阻
	P00C |= 0x10;					//下拉电阻选择为强下拉
// 	P00C &= ~0x10;					//下拉电阻选择为弱下拉
	
	P00F = P00_COM0_SETTING;		//P00设置为COM引脚功能

*********************************************************************************************************************/	
/*****************************************************************************
 ** \brief	 GPIO_Init	
			 GPIO_Init初始化GPIO函数,比如按键开光输入输出
 ** \param   [in] none       
 ** \return   none
*****************************************************************************/
void GPIO_init(void)
{	
/*DCDC 开漏输出	P45	*/
	P45F = OUTPUT|OP_EN;			//P45设置为开漏输出 
//	P45C |= 0x20;					//上拉电阻选择为强上拉
// 	P45C &= ~0x20;					//上拉电阻选择为弱上拉	
	P45 = 0;						//P45输出置零 开启模组电源	
	
/*充电检测。P46 充电插入检测，P47 充电状态检测*/
	P46F = INPUT|PU_EN;				//P46设置为输入模式并使能上拉电阻 
	P46C |= 0x20;					//上拉电阻选择为强上拉
// 	P46C &= ~0x20;					//上拉电阻选择为弱上拉	
	P47F = INPUT|PU_EN;				//P47设置为输入模式并使能上拉电阻 
//	P47C |= 0x20;					//上拉电阻选择为强上拉
 	P47C &= ~0x20;					//上拉电阻选择为弱上拉	
	
/* 背光输出控制 P32*/	
	P32F = OUTPUT;					//P32设置为推挽输出模式	
	P32	 = 0;						//默认背光关闭
/* 蜂鸣器输出控制 P33 PWM*/	
	P33F = P33_PWM6_SETTING;		//P33设置为PWM 输出模式
	P33	 = 0;						//默认蜂鸣器关闭
	
	
	
	
}

/*****************************************************************************
 ** \brief	 I2C_init	
			 I2C_init 温湿度接口初始化
 ** \param   [in] none       
 ** \return   none
*****************************************************************************/
void I2C_init(void)
{
/**********选择I2C端口************************************************************/
	I2CIOS = 0;
	P36F = P36_I2C_SDA_SETTING | PU_EN;
	P37F = P37_I2C_SCL_SETTING | PU_EN;		
}

/*****************************************************************************
 ** \brief	 Zigbee_GPIO_init	
			 Zigbee_GPIO_init与模组管脚通讯pin脚
 ** \param   [in] none       
 ** \return   none
*****************************************************************************/
void Zigbee_GPIO_init(void)
{
/**********选择UART0端口************************************************************/
	#ifdef UART0_EN
	P31F = P31_UART0_RX_SETTING;
	P30F = P30_UART0_TX_SETTING;	
	#endif
/*	P04 模组唤醒MCU P05  MCU唤醒模组	*/
	P04F = INPUT;				//P04设置为输入模式
	P05F = OUTPUT|OP_EN;		//P05设置为开漏输出 
	P05  = 0;					//P05输出置零
}



#endif
